import React from 'react';
import { Link } from 'react-router-dom';
import Header from '../menu/Header';

const Rules = () => {
  return (
    <div>
      <Header />
      <h1>Правила гри</h1>
      <h2>Загальні</h2>
      <p>
        Гра призначена для партнерів, що знову познайомилися і бажають зблизитися, для подружжя або
        пар, що вже склалися, адже звички - головний ворог близькості, а одноманітність вбиває
        любов. Допоможе перевести стосунки на принципово інший рівень, поглянути на коханого з
        іншого боку, «піділлє масла у вогонь», внісши свіжий струмінь у інтимне життя, що почало
        тьмяніти.
      </p>
      <h2>Суть гри</h2>
      <p>
        1. Гра полягає у виконанні учасниками завдань, написаних на спеціальних картках-фантах, що
        випадково генеруються з колоди. Завдання виконуються гравцями відповідно до ролей, що
        визначаються жеребкуванням. 2. Гра має чотири формати або рівня «жорсткості»: «білий»,
        «жовтий», «рожевий» та «червоний». Відповідно і фанти бувають білими, жовтими, рожевими та
        червоними. «Білий» - «найм'якіший» і в основному зводиться до розповідей, розмов та спогадів
        на еротичні теми. При переході в міру гри до наступних форматів завдання стають все більш
        конкретними та реальними, закінчуючись сексом у «червоному» форматі. 3. При переході до
        «рожевої» гри гравці разом миються у ванні і це – перше рожеве завдання. 4. У принципі гру
        не обов'язково доводити до сексу, а, обмежившись «м'якими» форматами, перетворити її на
        захоплюючий розіграш еротичної спрямованості.
      </p>
      <h2>Підготовка до гри</h2>
      <p>
        1. Найважливішим є психологічний настрій на гру кожного з учасників. "Незручно", "соромно",
        "непристойно", - слід повністю забути про ці поняття, вони не потрібні передусім самому
        гравцю. Розкутість, щирість і бажання отримати задоволення без жодних умовностей чи
        побоювань – ось основні принципи Ігри. 2. Цілком ймовірно, що в процесі Ігри вам доведеться
        цілуватися, роздягатися і «стояти на голові». Врахуйте це: одягніть гарну спідню білизну, не
        їжте щільно перед грою, пожуйте «Орбіт», утримайтеся від часнику і поставте клізмочку, якщо
        плануєте анальний секс. Дівчатам настійно рекомендується одягатися до гри, маючи панчохи на
        поясі. 3. Створіть відповідну атмосферу у місці проведення Ігри, це багато в чому визначить
        психологічний настрій на неї. Особливий інтер'єр, свічки, запахи, музика... - все має бути
        красиво, не стандартно та романтично. 4. Можна цілком успішно проводити гру, обмежившись
        лише тими реквізитами, що є у вас, або замінити їх аналогами. «Поле для творчості» можна
        суттєво розширити, маючи хоча б частково наступні додаткові аксесуари: - банани, яблука,
        полуниця, лимон, рідкий шоколад (вершки, джем, мед), лікер Бейліс, Текіла, вино, лід; -
        масажна олія, спеціальні мастила, еротична білизна, білий пензлик для макіяжу; -
        секс-іграшки (залежно від індивідуальних смаків та можливостей): вібратори (одинарний та
        подвійний), кліторально-вагінальний вібратор, віброкільце, фалоімітатори на присосці
        (одинарний та подвійний), вагінальні віброкульки, країною (фалоімітатор на трусиках),
        анальні вібратори анальні намисто, анальний вібромасажер.
      </p>
      <h1>
        Якщо у вас немає чогось із зазначеного, або вас бентежить завдання фанта, просто відкладіть
        його вбік і продовжуйте гру.
      </h1>
      <button className="btn">
        <Link to="/">На головну</Link>
      </button>
      <button className="btn">
        <Link to="/gametype">Вибір режиму гри</Link>
      </button>
    </div>
  );
};

export default Rules;
